yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp

#include "dlms_cosem.h"
#include "axdr_parser.h"
#include "esphome/core/application.h"
#include "esphome/core/helpers.h"
#include "esphome/core/log.h"
#ifdef USE_ESP_IDF
#include <esp_heap_caps.h>
#endif
#include <sstream>
#include <ranges>
#include "dlms_cosem_helpers.h"

// zmeny Yarda
// dlms_cosem.cpp
#include <Arduino.h>
#if defined(ARDUINO_ARCH_RP2040)
  #include <RP2040.h>  // Earle Philhower core
#endif
// zmeny Yarda

namespace esphome {
namespace dlms_cosem {

static const char *TAG0 = "dlms_cosem_";

#define TAG (this->tag_.c_str())

static constexpr uint8_t SOH = 0x01;
static constexpr uint8_t STX = 0x02;
static constexpr uint8_t ETX = 0x03;
static constexpr uint8_t EOT = 0x04;
static constexpr uint8_t ENQ = 0x05;
static constexpr uint8_t ACK = 0x06;
static constexpr uint8_t CR = 0x0D;
static constexpr uint8_t LF = 0x0A;
static constexpr uint8_t NAK = 0x15;

static constexpr uint8_t HDLC_FLAG = 0x7E;

static const uint8_t CMD_ACK_SET_BAUD_AND_MODE[] = {ACK, '0', '5', '1', CR, LF};
static const uint8_t CMD_CLOSE_SESSION[] = {SOH, 0x42, 0x30, ETX, 0x75};

static constexpr uint8_t BOOT_WAIT_S = 10;

static char empty_str[] = "";

/*
static char format_hex_char(uint8_t v) { return v >= 10 ? 'A' + (v - 10) : '0' +
v; }

static std::string format_frame_pretty(const uint8_t *data, size_t length) {
  if (length == 0)
    return "";
  std::string ret;
  ret.resize(3 * length - 1);
  std::ostringstream ss(ret);

  for (size_t i = 0; i < length; i++) {
    switch (data[i]) {
      case 0x00:
        ss << "<NUL>";
        break;
      case 0x01:
        ss << "<SOH>";
        break;
      case 0x02:
        ss << "<STX>";
        break;
      case 0x03:
        ss << "<ETX>";
        break;
      case 0x04:
        ss << "<EOT>";
        break;
      case 0x05:
        ss << "<ENQ>";
        break;
      case 0x06:
        ss << "<ACK>";
        break;
      case 0x0d:
        ss << "<CR>";
        break;
      case 0x0a:
        ss << "<LF>";
        break;
      case 0x15:
        ss << "<NAK>";
        break;
      case 0x20:
        ss << "<SP>";
        break;
      case 0x7E:
        ss << "<FLAG>";
        break;
      default:
        if (data[i] <= 0x20 || data[i] >= 0x7f) {
          ss << "<" << format_hex_char((data[i] & 0xF0) >> 4) <<
format_hex_char(data[i] & 0x0F) << ">"; } else { ss << (char) data[i];
        }
        break;
    }
  }
  if (length > 4)
    ss << " (" << length << ")";
  return ss.str();
}

uint8_t baud_rate_to_byte(uint32_t baud) {
  constexpr uint16_t BAUD_BASE = 300;
  constexpr uint8_t BAUD_MULT_MAX = 6;

  uint8_t idx = 0;  // 300
  for (size_t i = 0; i <= BAUD_MULT_MAX; i++) {
    if (baud == BAUD_BASE * (1 << i)) {
      idx = i;
      break;
    }
  }
  return idx + '0';
}
*/

void DlmsCosemComponent::set_baud_rate_(uint32_t baud_rate) {
  ESP_LOGV(TAG, "Setting baud rate %u bps", baud_rate);
  iuart_->update_baudrate(baud_rate);
}

void DlmsCosemComponent::set_server_address(uint16_t address) { this->server_address_ = address; };

uint16_t DlmsCosemComponent::set_server_address(uint16_t logicalAddress, uint16_t physicalAddress,
                                                unsigned char addressSize) {
  this->server_address_ = cl_getServerAddress(logicalAddress, physicalAddress, addressSize);

  ESP_LOGD(TAG,
           "Server address = %d (based on logical_address=%d, "
           "physical_address=%d, address_size=%d)",
           this->server_address_, logicalAddress, physicalAddress, addressSize);
  return this->server_address_;
}

void DlmsCosemComponent::update_server_address(uint16_t addr) {
  this->server_address_ = addr;
  cl_clear(&dlms_settings_);
  cl_init(&dlms_settings_, true, this->client_address_, this->server_address_,
          this->auth_required_ ? DLMS_AUTHENTICATION_LOW : DLMS_AUTHENTICATION_NONE,
          this->auth_required_ ? this->password_.c_str() : NULL, DLMS_INTERFACE_TYPE_HDLC);

  this->update();
}

uint16_t DlmsCosemComponent::update_server_address(uint16_t logicalAddress, uint16_t physicalAddress,
                                                   unsigned char addressSize) {
  this->set_server_address(logicalAddress, physicalAddress, addressSize);
  this->update_server_address(this->server_address_);
  return this->server_address_;
}

void DlmsCosemComponent::setup() {
  ESP_LOGI(TAG, "DLMS setup(): begin");

#if defined(ARDUINO_ARCH_RP2040)
  ESP_LOGI(TAG, "Heap at setup entry: %u", (unsigned)rp2040.getFreeHeap());
#endif

  // ❗ Nedělej nic těžkého hned — žádné cl_init(), žádné DLMS buffery,
  // žádný parser, žádný UART lock. To vše se přesune níže.

  this->indicate_transmission(false);

#if defined(USE_RP2040)
  // ░░ RP2040: pouze vytvoříme UART wrapper, nic víc
  iuart_ = make_unique<DlmsCosemUart>(*static_cast<uart::RP2040UartComponent *>(this->parent_));
#elif defined (USE_ESP32)
  iuart_ = make_unique<DlmsCosemUart>(*static_cast<uart::IDFUARTComponent *>(this->parent_));
#endif
#if USE_ESP8266
  iuart_ = make_unique<DlmsCosemUart>(*static_cast<uart::ESP8266UartComponent *>(this->parent_));
#endif
  if (this->flow_control_pin_ != nullptr) {
    this->flow_control_pin_->setup();
  }

  // ░░ Teprve po stabilizaci ESPHome systému spustíme DLMS
  //    (USB, WiFi, API, mDNS, logger, watchdog, scheduler)
  const uint32_t DELAY_START_MS = 9000;   // 9 sekund – ideální pro Pico W

  this->set_timeout(DELAY_START_MS, [this]() {

    ESP_LOGI(TAG, "DLMS delayed start after WiFi/API init");

#if defined(ARDUINO_ARCH_RP2040)
    ESP_LOGI(TAG, "Heap before DLMS init: %u", (unsigned)rp2040.getFreeHeap());
#endif

    // ░░ Nyní provedeme DLMS inicializaci
    cl_init(&dlms_settings_, true, this->client_address_, this->server_address_,
            this->auth_required_ ? DLMS_AUTHENTICATION_LOW : DLMS_AUTHENTICATION_NONE,
            this->auth_required_ ? this->password_.c_str() : NULL,
            DLMS_INTERFACE_TYPE_HDLC);

    // ░░ Buffer – malý začáteční buffer pro RP2040 (PUSH mód rozšiřuje později)
    const size_t START_INBUF = 512;   // bezpečná velikost
    this->buffers_.init(START_INBUF);

    // ░░ PUSH MODE – vytvoříme parser až teď (bez <ranges>)
#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
  if (this->is_push_mode()) {
    CosemObjectFoundCallback fn = [this](auto... args) { (void) this->set_sensor_value(args...); };

    this->axdr_parser_ = new AxdrStreamParser(&this->buffers_.in, fn, this->push_show_log_);

