yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp
    // default patterns
    this->axdr_parser_->register_pattern_dsl("HAN-DTM", "F,TO,TVOSDTM");
    this->axdr_parser_->register_pattern_dsl("DEV-ID", "S2(TO,TV)");  // Device ID structures (2 elements)
    this->axdr_parser_->register_pattern_dsl("T1", "TC,TO,TS,TV");
    this->axdr_parser_->register_pattern_dsl("T2", "TO,TV,TSU");
    this->axdr_parser_->register_pattern_dsl("T3", "TV,TC,TSU,TO");
    this->axdr_parser_->register_pattern_dsl("U.ZPA", "F,C,O,A,TV");

    // user-provided pattern
    if (this->push_custom_pattern_dsl_.length() > 0) {
      auto split_view = this->push_custom_pattern_dsl_ | std::views::split(';');
      for (const auto &pattern : split_view) {
        std::string pattern_str;
        for (auto it = pattern.begin(); it != pattern.end(); ++it) {
          pattern_str += *it;
        }
        this->axdr_parser_->register_pattern_dsl("CUSTOM", pattern_str, 0);
      }
    }

    // ░░ Až teď je bezpečné locknout UART
    if (!this->try_lock_uart_session_()) {
      ESP_LOGE(TAG, "DLMS UART lock failed — is the UART used by something else?");
      return;
    }
  }
#endif
    ESP_LOGI(TAG, "DLMS initialized successfully, switching to IDLE state");
#if defined(ARDUINO_ARCH_RP2040)
    ESP_LOGI(TAG, "Heap after DLMS init: %u", (unsigned)rp2040.getFreeHeap());
#endif

    this->set_next_state_(State::IDLE);
  });
}

void DlmsCosemComponent::dump_config() {
  ESP_LOGCONFIG(TAG, "DLMS-COSEM (SPODES):");
  LOG_UPDATE_INTERVAL(this);
  LOG_PIN("  Flow Control Pin: ", this->flow_control_pin_);
  ESP_LOGCONFIG(TAG, "  Receive Timeout: %ums", this->receive_timeout_ms_);
  ESP_LOGCONFIG(TAG, "  Supported Meter Types: DLMS/COSEM (SPODES)");
  ESP_LOGCONFIG(TAG, "  Client address: %d", this->client_address_);
  ESP_LOGCONFIG(TAG, "  Server address: %d", this->server_address_);
  ESP_LOGCONFIG(TAG, "  Authentication: %s", this->auth_required_ == DLMS_AUTHENTICATION_NONE ? "None" : "Low");
  ESP_LOGCONFIG(TAG, "  P*ssword: %s", this->password_.c_str());
  ESP_LOGCONFIG(TAG, "  Sensors:");
  for (const auto &sensors : sensors_) {
    auto &s = sensors.second;
    ESP_LOGCONFIG(TAG, "    OBIS code: %s, Name: %s", s->get_obis_code().c_str(), s->get_sensor_name().c_str());
  }
}

void DlmsCosemComponent::register_sensor(DlmsCosemSensorBase *sensor) {
  this->sensors_.insert({sensor->get_obis_code(), sensor});
}

void DlmsCosemComponent::abort_mission_() {
#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
  if (this->is_push_mode()) {
    ESP_LOGV(TAG, "Push mode error, returning to listening");
    this->clear_rx_buffers_();
    this->set_next_state_(State::IDLE);
    return;
  }
#endif
  // Existing pull mode logic
  ESP_LOGE(TAG, "Abort mission. Closing session");
  this->set_next_state_(State::MISSION_FAILED);
}

void DlmsCosemComponent::report_failure(bool failure) {
  if (!failure) {
    this->stats_.failures_ = 0;
    return;
  }

  this->stats_.failures_++;
  if (this->failures_before_reboot_ > 0 && this->stats_.failures_ > this->failures_before_reboot_) {
    ESP_LOGE(TAG, "Too many failures in a row. Let's try rebooting device.");
    delay(100);
    App.safe_reboot();
  }
}

void DlmsCosemComponent::loop() {
  if (!this->is_ready() || this->state_ == State::NOT_INITIALIZED)
    return;

  switch (this->state_) {
    case State::IDLE: {
      this->update_last_rx_time_();

      if (!this->is_push_mode()) {
        this->indicate_transmission(false);
        this->indicate_session(false);
      }

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE

      // Push mode listening logic
      if (this->is_push_mode()) {
        if (this->available() > 0) {
          // Set up for receiving push data
          memset(this->buffers_.in.data, 0, buffers_.in.capacity);
          this->buffers_.in.size = 0;
          // read what we can then move forward to avoid buffer overflow
          this->receive_frame_raw_();

          ESP_LOGV(TAG, "Push mode: incoming data detected");
          this->stats_.connections_tried_++;
          this->loop_state_.session_started_ms = millis();

          this->indicate_transmission(true);

          reading_state_.next_state = State::PUSH_DATA_PROCESS;
          reading_state_.mission_critical = false;  // Never critical in push mode
          this->set_next_state_(State::COMMS_RX);
        }
      }
#endif

    } break;

    case State::TRY_LOCK_BUS: {
      this->log_state_();
      if (this->try_lock_uart_session_()) {
        this->indicate_session(true);
        this->indicate_connection(true);
        this->set_next_state_(State::OPEN_SESSION);
      } else {
        ESP_LOGV(TAG, "UART Bus is busy, waiting ...");
        this->set_next_state_delayed_(1000, State::TRY_LOCK_BUS);
      }
    } break;

    case State::WAIT:
      if (this->check_wait_timeout_()) {
        this->set_next_state_(this->wait_.next_state);
        this->update_last_rx_time_();
      }
      break;

    case State::COMMS_TX: {
      this->log_state_();
      this->indicate_transmission(true);
      if (buffers_.has_more_messages_to_send()) {
        send_dlms_messages_();
      } else {
        this->set_next_state_(State::COMMS_RX);
      }
    } break;

    case State::COMMS_RX: {
      this->handle_comms_rx_();
    } break;

    case State::MISSION_FAILED: {
      //  this->send_frame_(CMD_CLOSE_SESSION, sizeof(CMD_CLOSE_SESSION));
      if (!this->is_push_mode()) {
        this->unlock_uart_session_();
      }
      this->set_next_state_(State::IDLE);
      this->report_failure(true);
      this->stats_dump();
    } break;

    case State::OPEN_SESSION: {
      this->handle_open_session_();
    } break;

      // case State::OPEN_SESSION_GET_ID:
      //   this->log_state_();

      //   if (received_frame_size_) {
      //     char *id = nullptr;  //
      //     this->extract_meter_id_(received_frame_size_); if (id == nullptr) {
      //       ESP_LOGE(TAG, "Invalid meter identification frame");
      //       this->stats_.invalid_frames_++;
      //       this->abort_mission_();
      //       return;
      //     }

