yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp
      //     this->update_last_rx_time_();
      //   }
      //   break;

    case State::BUFFERS_REQ: {
      this->handle_buffers_req_();
    } break;

    case State::BUFFERS_RCV: {
      this->handle_buffers_rcv_();
    } break;

    case State::ASSOCIATION_REQ: {
      this->handle_association_req_();
    } break;

    case State::ASSOCIATION_RCV: {
      this->handle_association_rcv_();
    } break;

    case State::DATA_ENQ_UNIT: {
      this->handle_data_enq_unit_();
    } break;

    case State::DATA_ENQ: {
      this->handle_data_enq_();
    } break;

    case State::DATA_RECV: {
      this->handle_data_recv_();
    } break;

    case State::DATA_NEXT: {
      this->handle_data_next_();
    } break;

    case State::SESSION_RELEASE: {
      this->handle_session_release_();
    } break;

    case State::DISCONNECT_REQ: {
      this->handle_disconnect_req_();
    } break;

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
    case State::PUSH_DATA_PROCESS: {
      this->handle_push_data_process_();
    } break;
#endif

    case State::PUBLISH: {
      this->handle_publish_();
    } break;

    default:
      break;
  }
}

void DlmsCosemComponent::handle_comms_rx_() {
  this->log_state_();

  if (this->check_rx_timeout_()) {
    if (this->is_push_mode()) {
      ESP_LOGI(TAG, "Push data reception completed (timeout reached)");
    } else {
      ESP_LOGE(TAG, "RX timeout.");
      this->has_error = true;
      this->dlms_reading_state_.last_error = DLMS_ERROR_CODE_HARDWARE_FAULT;
      this->stats_.invalid_frames_ += reading_state_.err_invalid_frames;
    }

    this->indicate_connection(false);
    this->indicate_transmission(false);

    if (this->is_push_mode()) {
#ifdef ENABLE_DLMS_COSEM_PUSH_MODE

      // check if we received any data at all
      this->indicate_connection(true);
      if (this->buffers_.in.size > 0) {
        ESP_LOGV(TAG, "Push mode RX data avail, len=%d", this->buffers_.in.size);
        this->set_next_state_(State::PUSH_DATA_PROCESS);
      } else {
        ESP_LOGV(TAG, "Push mode RX timeout, no data, idling");
        this->set_next_state_(State::IDLE);
      }
#endif
    } else if (reading_state_.mission_critical) {
      ESP_LOGE(TAG, "Mission critical RX timeout.");
      this->abort_mission_();
    } else {
      // if not move forward
      reading_state_.err_invalid_frames++;
      this->set_next_state_(reading_state_.next_state);
    }
    return;
  }

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE

  if (this->is_push_mode()) {
    received_frame_size_ = this->receive_frame_raw_();
    // this->update_last_rx_time_();
    //  keep reading until timeout
    return;
  }
#endif

  // the following basic algorithm to be implemented to read DLMS packet
  // first version, no retries
  // 1. receive proper hdlc frame
  // 2. get data from hdlc frame
  // 3. if ret = 0 or ret = DLMS_ERROR_CODE_FALSE then stop
  // 4. check reply->complete. if it is 0 then continue reading, go to 1
  //
  // read hdlc frame
  received_frame_size_ = this->receive_frame_hdlc_();

  if (received_frame_size_ == 0) {
    // keep reading until proper frame is received
    return;
  }

  this->update_last_rx_time_();

  // this->set_next_state_(reading_state_.next_state);

  auto ret = dlms_getData2(&dlms_settings_, &buffers_.in, &buffers_.reply, 0);
  if (ret != DLMS_ERROR_CODE_OK || buffers_.reply.complete == 0) {
    ESP_LOGVV(TAG, "dlms_getData2 ret = %d %s reply.complete = %d", ret, dlms_error_to_string(ret),
              buffers_.reply.complete);
  }

  if (ret != DLMS_ERROR_CODE_OK && ret != DLMS_ERROR_CODE_FALSE) {
    ESP_LOGE(TAG, "dlms_getData2 failed. ret %d %s", ret, dlms_error_to_string(ret));
    this->reading_state_.err_invalid_frames++;
    this->set_next_state_(reading_state_.next_state);
    return;
  }

  if (buffers_.reply.complete == 0) {
    ESP_LOGD(TAG, "DLMS Reply not complete, need more HDLC frames. "
                  "Continue reading.");
    // data in multiple frames.
    // we just keep reading until full reply is received.
    return;  // keep reading
  }

  this->update_last_rx_time_();
  this->set_next_state_(reading_state_.next_state);

  auto parse_ret = this->dlms_reading_state_.parser_fn();
  this->dlms_reading_state_.last_error = parse_ret;

  if (parse_ret == DLMS_ERROR_CODE_OK) {
    //        ESP_LOGD(TAG, "DLSM parser fn result == DLMS_ERROR_CODE_OK");

  } else {
    ESP_LOGE(TAG, "DLMS parser fn error %d %s", parse_ret, dlms_error_to_string(parse_ret));

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
    if (this->is_push_mode()) {
      ESP_LOGV(TAG, "Push mode parse error, returning to listening");
      this->set_next_state_(State::IDLE);
    } else
#endif
        if (reading_state_.mission_critical) {
      this->abort_mission_();
    }
    // if not critical - just move forward
    // set_next_state_(State::IDLE);
  }
}

void DlmsCosemComponent::handle_open_session_() {
  this->stats_.connections_tried_++;
  this->loop_state_.session_started_ms = millis();
  this->log_state_();
  this->clear_rx_buffers_();
  this->loop_state_.request_iter = this->sensors_.begin();

  this->set_next_state_(State::BUFFERS_REQ);

  // if (false) {
  //   // TODO. check if IEC handshake is needed

  //   uint8_t open_cmd[32]{0};
  //   uint8_t open_cmd_len = snprintf((char *) open_cmd, 32, "/?%s!\r\n",
  //   this->meter_address_.c_str()); request_iter = this->sensors_.begin();
  //   this->send_frame_(open_cmd, open_cmd_len);
  //   this->set_next_state_(State::OPEN_SESSION_GET_ID);
  //   auto read_fn = [this]() { return this->receive_frame_ascii_(); };
  //   // mission crit, no crc
  //   this->read_reply_and_go_next_state_(read_fn,
  //   State::OPEN_SESSION_GET_ID, 0, true, false);
  // }
}

void DlmsCosemComponent::handle_buffers_req_() {
  this->log_state_();
  this->prepare_and_send_dlms_buffers();
}

void DlmsCosemComponent::handle_buffers_rcv_() {
  this->log_state_();
  // check the reply and go to next stage
  // todo smth with buffers reply
  this->set_next_state_(State::ASSOCIATION_REQ);
}

void DlmsCosemComponent::handle_association_req_() {
  this->log_state_();
  this->prepare_and_send_dlms_aarq();
}

