yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp
void DlmsCosemComponent::handle_association_rcv_() {
  // check the reply and go to next stage
  // todo smth with aarq reply
  this->set_next_state_(State::DATA_ENQ_UNIT);
}

void DlmsCosemComponent::handle_data_enq_unit_() {
  this->log_state_();
  if (this->loop_state_.request_iter == this->sensors_.end()) {
    ESP_LOGD(TAG, "All requests done");
    this->set_next_state_(State::SESSION_RELEASE);
    return;
  }

  auto req = this->loop_state_.request_iter->first;
  auto sens = this->loop_state_.request_iter->second;
  auto type = sens->get_obis_class();

  ESP_LOGD(TAG, "OBIS code: %s, Sensor: %s", req.c_str(), sens->get_sensor_name().c_str());

  // request units for numeric sensors only and only once
  if (sens->get_type() == SensorType::SENSOR && type == DLMS_OBJECT_TYPE_REGISTER && !sens->has_got_scale_and_unit()) {
    // if (type == DLMS_OBJECT_TYPE_REGISTER)
    //        if (sens->get_attribute() != 2) {
    this->buffers_.gx_attribute = 3;
    this->prepare_and_send_dlms_data_unit_request(req.c_str(), type);
  } else {
    // units not working so far... so we are requesting just data
    this->set_next_state_(State::DATA_ENQ);
  }
}

void DlmsCosemComponent::handle_data_enq_() {
  this->log_state_();
  if (this->loop_state_.request_iter == this->sensors_.end()) {
    ESP_LOGD(TAG, "All requests done");
    this->set_next_state_(State::SESSION_RELEASE);
    return;
  }

  auto req = this->loop_state_.request_iter->first;
  auto sens = this->loop_state_.request_iter->second;
  auto type = sens->get_obis_class();
  bool is_text_sensor = sens->get_type() == SensorType::TEXT_SENSOR;
  bool skip_gurux_value_update =
      is_text_sensor && type != DLMS_OBJECT_TYPE_CLOCK;  // avoid using Gurux cl_updateValue for non-numeric sensors,
                                                         // since it leaks memory in this case
  auto units_were_requested =
      (sens->get_type() == SensorType::SENSOR && type == DLMS_OBJECT_TYPE_REGISTER && !sens->has_got_scale_and_unit());
  if (units_were_requested) {
    auto ret = this->set_sensor_scale_and_unit(static_cast<DlmsCosemSensor *>(sens));
  }

#ifdef USE_TEXT_SENSOR
  if (sens->get_type() == SensorType::TEXT_SENSOR) {
    var_clear(&this->buffers_.gx_register.value);
  }
#endif

  this->buffers_.gx_attribute = 2;
  this->prepare_and_send_dlms_data_request(req.c_str(), type, !units_were_requested, skip_gurux_value_update);
}

void DlmsCosemComponent::handle_data_recv_() {
  this->log_state_();
  this->set_next_state_(State::DATA_NEXT);

  auto req = this->loop_state_.request_iter->first;
  auto sens = this->loop_state_.request_iter->second;
  auto ret = this->set_sensor_value(sens, req.c_str());
}

void DlmsCosemComponent::handle_data_next_() {
  this->log_state_();
  this->loop_state_.request_iter = this->sensors_.upper_bound(this->loop_state_.request_iter->first);
  if (this->loop_state_.request_iter != this->sensors_.end()) {
    this->set_next_state_delayed_(this->delay_between_requests_ms_, State::DATA_ENQ_UNIT);
  } else {
    this->set_next_state_delayed_(this->delay_between_requests_ms_, State::SESSION_RELEASE);
  }
}

void DlmsCosemComponent::handle_session_release_() {
  this->loop_state_.sensor_iter = this->sensors_.begin();

  this->log_state_();
  ESP_LOGD(TAG, "Session release request");
  if (this->auth_required_) {
    this->prepare_and_send_dlms_release();
  } else {
    this->set_next_state_(State::DISCONNECT_REQ);
  }
}

void DlmsCosemComponent::handle_disconnect_req_() {
  this->log_state_();
  ESP_LOGD(TAG, "Disconnect request");
  this->prepare_and_send_dlms_disconnect();
}

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
void DlmsCosemComponent::handle_push_data_process_() {
  this->log_state_();
  ESP_LOGD(TAG, "Processing received push data");
  this->loop_state_.sensor_iter = this->sensors_.begin();
  this->set_next_state_(State::PUBLISH);
  this->process_push_data();
  this->clear_rx_buffers_();
}
#endif

void DlmsCosemComponent::handle_publish_() {
  this->log_state_();
  ESP_LOGD(TAG, "Publishing data");
  this->update_last_rx_time_();

  if (this->loop_state_.sensor_iter != this->sensors_.end()) {
    auto *sensor_base = this->loop_state_.sensor_iter->second;
    if (sensor_base->shall_we_publish()) {
      sensor_base->publish();
    }
    this->loop_state_.sensor_iter++;
  } else {
    this->stats_dump();
    if (this->crc_errors_per_session_sensor_ != nullptr) {
      this->crc_errors_per_session_sensor_->publish_state(this->stats_.crc_errors_per_session());
    }
    this->report_failure(false);
    if (!this->is_push_mode()) {
      this->unlock_uart_session_();
    }

    {
// zmeny Yarda
#ifdef ARDUINO_ARCH_RP2040
      uint32_t h = rp2040.getFreeHeap();
// zmeny Yarda
#elif defined(USE_ARDUINO)
      uint32_t h = ESP.getFreeHeap();
#else
      uint32_t h = esp_get_free_heap_size();
#endif

      int32_t diff = this->last_free_heap_ - h;
      if (diff == 0 || this->last_free_heap_ == 0) {
        ESP_LOGV(TAG, "Free heap: %d; stable", h);
      } else {
        ESP_LOGW(TAG, "Free heap: %d; diff %d", h, diff);
      }
      this->last_free_heap_ = h;
    }

    this->set_next_state_(State::IDLE);
    ESP_LOGD(TAG, "Total time: %u ms", millis() - this->loop_state_.session_started_ms);
  }
}

void DlmsCosemComponent::update() {
#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
  if (this->is_push_mode()) {
    // publish?
    return;
  }
#endif

  if (this->state_ != State::IDLE) {
    ESP_LOGD(TAG, "Starting data collection impossible - component not ready");
    return;
  }
  ESP_LOGD(TAG, "Starting data collection");
  this->has_error = false;
  this->set_next_state_(State::TRY_LOCK_BUS);
}

bool char2float(const char *str, float &value) {
  char *end;
  value = strtof(str, &end);
  return *end == '\0';
}

void DlmsCosemComponent::set_next_state_delayed_(uint32_t ms, State next_state) {
  if (ms == 0) {
    set_next_state_(next_state);
  } else {
    ESP_LOGV(TAG, "Short delay for %u ms", ms);
    set_next_state_(State::WAIT);
    wait_.start_time = millis();
    wait_.delay_ms = ms;
    wait_.next_state = next_state;
  }
}

