yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp
  // Ensure we parse from the beginning of the collected frame
  this->buffers_.in.position = 0;
  const auto total_size = this->buffers_.in.size;
  ESP_LOGD(TAG, "PUSH frame size: %u bytes", static_cast<unsigned>(total_size));

  size_t total_objects = 0;
  size_t iterations = 0;

  while (this->buffers_.in.position < this->buffers_.in.size) {
    auto before = this->buffers_.in.position;
    auto parsed_now = this->axdr_parser_->parse();
    auto after = this->buffers_.in.position;
    iterations++;

    if (parsed_now == 0 && after == before) {
      // No progress, avoid potential infinite loop on malformed frames
      ESP_LOGW(TAG, "AXDR parser made no progress at pos=%u/%u, aborting", static_cast<unsigned>(after),
               static_cast<unsigned>(this->buffers_.in.size));
      break;
    }
    total_objects += parsed_now;
    ESP_LOGV(TAG, "AXDR iteration %u: parsed=%u, pos=%u/%u, objects_total=%u", static_cast<unsigned>(iterations),
             static_cast<unsigned>(parsed_now), static_cast<unsigned>(after),
             static_cast<unsigned>(this->buffers_.in.size), static_cast<unsigned>(total_objects));
  }

  ESP_LOGD(TAG, "PUSH data parsing complete: %u objects, bytes consumed %u/%u", static_cast<unsigned>(total_objects),
           static_cast<unsigned>(this->buffers_.in.position), static_cast<unsigned>(total_size));
}

int DlmsCosemComponent::set_sensor_value(uint16_t class_id, const uint8_t *obis_code, DLMS_DATA_TYPE value_type,
                                         const uint8_t *value_buffer_ptr, uint8_t value_length, const int8_t *scaler,
                                         const uint8_t *unit) {
  static char obis_buf[32];
  auto er = hlp_getLogicalNameToString(obis_code, obis_buf);

  std::string obis_str(obis_buf);

  auto range = this->sensors_.equal_range(obis_str);
  int found_count = 0;
  for (auto it = range.first; it != range.second; ++it) {
    DlmsCosemSensorBase *sensor = it->second;
    if (!sensor->shall_we_publish()) {
      continue;
    }
    ESP_LOGD(TAG, "Found sensor for OBIS code %s: '%s' ", obis_buf, sensor->get_sensor_name().c_str());
    found_count++;

#ifdef USE_SENSOR
    if (sensor->get_type() == SensorType::SENSOR) {
      float val = dlms_data_as_float(value_type, value_buffer_ptr, value_length);
      if (scaler != nullptr) {
        float scale = pow(10, *scaler);
        val *= scale;
      }
      static_cast<DlmsCosemSensor *>(sensor)->set_value(val);
    }
#endif

#ifdef USE_TEXT_SENSOR
    if (sensor->get_type() == SensorType::TEXT_SENSOR) {
      auto val = dlms_data_as_string(value_type, value_buffer_ptr, value_length);
      static_cast<DlmsCosemTextSensor *>(sensor)->set_value(val.c_str(), this->cp1251_conversion_required_);
    }
#endif
  }

  if (found_count == 0) {
    ESP_LOGVV(TAG, "No sensor found for OBIS code: '%s'", (char *) obis_buf);
  } else {
    ESP_LOGVV(TAG, "Updated %d sensors for OBIS code: '%s'", found_count, (char *) obis_buf);
  }

  return DLMS_ERROR_CODE_OK;
}

#endif  // ENABLE_DLMS_COSEM_PUSH_MODE

int DlmsCosemComponent::set_sensor_scale_and_unit(DlmsCosemSensor *sensor) {
  ESP_LOGD(TAG, "set_sensor_scale_and_unit");
  if (!buffers_.reply.complete)
    return DLMS_ERROR_CODE_FALSE;
  auto vt = buffers_.reply.dataType;
  ESP_LOGD(TAG, "DLMS_DATA_TYPE: %s (%d)", dlms_data_type_to_string(vt), vt);
  if (vt != 0) {
    return DLMS_ERROR_CODE_FALSE;
  }

  auto scal = this->buffers_.gx_register.scaler;
  auto unit = this->buffers_.gx_register.unit;
  auto unit_s = obj_getUnitAsString(unit);
  sensor->set_scale_and_unit(scal, unit, unit_s);

  return DLMS_ERROR_CODE_OK;
}

int DlmsCosemComponent::set_sensor_value(DlmsCosemSensorBase *sensor, const char *obis) {
  if (!buffers_.reply.complete || !sensor->shall_we_publish()) {
    return this->dlms_reading_state_.last_error;
  }

  auto vt = buffers_.reply.dataType;
  auto object_class = sensor->get_obis_class();
  ESP_LOGD(TAG, "Class: %d, OBIS code: %s, DLMS_DATA_TYPE: %s (%d)", object_class, obis, dlms_data_type_to_string(vt),
           vt);

  //      if (cosem_rr_.result().has_value()) {
  if (this->dlms_reading_state_.last_error == DLMS_ERROR_CODE_OK) {
    // result is okay, value shall be there

#ifdef USE_SENSOR
    if (sensor->get_type() == SensorType::SENSOR) {
      if ((object_class == DLMS_OBJECT_TYPE_DATA) || (object_class == DLMS_OBJECT_TYPE_REGISTER) ||
          (object_class == DLMS_OBJECT_TYPE_EXTENDED_REGISTER)) {
        auto var = &this->buffers_.gx_register.value;
        auto scale = static_cast<DlmsCosemSensor *>(sensor)->get_scale();
        auto unit = static_cast<DlmsCosemSensor *>(sensor)->get_unit();
        if (vt != DLMS_DATA_TYPE_NONE && vt != DLMS_DATA_TYPE_OCTET_STRING) {
          float val = static_cast<float>(var_toDouble(var));
          ESP_LOGD(TAG, "OBIS code: %s, Value: %f, Scale: %f, Unit: %s", obis, val, scale, unit);
          static_cast<DlmsCosemSensor *>(sensor)->set_value(val);
        }
      } else {
        ESP_LOGW(TAG, "Wrong OBIS class. Regular numberic sensors can only "
                      "handle Data (class 1), Registers (class = 3) and Extended Registers (class = 4)");
      }
    }
#endif  // USE_SENSOR

#ifdef USE_TEXT_SENSOR
    if (sensor->get_type() == SensorType::TEXT_SENSOR) {
      if (object_class == DLMS_OBJECT_TYPE_CLOCK) {
        static char obis_datetime_str[32];
        auto clock_gx_time = &this->buffers_.gx_clock.time;
        auto dt = clock_gx_time->value;
        time_t t = (time_t) dt;
        struct tm tm_val;
        localtime_r(&t, &tm_val);
        strftime(obis_datetime_str, sizeof(obis_datetime_str), "%Y-%m-%d %H:%M:%S", &tm_val);

        ESP_LOGD(TAG, "OBIS code: %s, Clock: %s", obis, obis_datetime_str);
        static_cast<DlmsCosemTextSensor *>(sensor)->set_value(obis_datetime_str, this->cp1251_conversion_required_);
        return this->dlms_reading_state_.last_error;
      }

      //
      // this section is made to avoid memory leaks found in gurux library after cl_updateValue for non-numerics
      //
      const uint8_t *raw_ptr = nullptr;
      uint16_t raw_len = 0;
      auto *reply_value = &this->buffers_.reply.dataValue;
      if (reply_value != nullptr && reply_value->byteArr != nullptr && reply_value->byteArr->size > 0) {
        raw_ptr = reply_value->byteArr->data;
        raw_len = reply_value->byteArr->size;
      } else {
        // Fallback to legacy object value path if parser populated gx_register.value.
        auto *var = &this->buffers_.gx_register.value;
        if (var != nullptr && var->byteArr != nullptr && var->byteArr->size > 0) {
          raw_ptr = var->byteArr->data;
          raw_len = var->byteArr->size;
        }
      }

      if (raw_ptr != nullptr && raw_len > 0) {
        ESP_LOGD(TAG, "data size=%d", raw_len);
        ESP_LOGV(TAG, "DATA: %s", format_hex_pretty(raw_ptr, raw_len).c_str());

