yarda-VP/esphome-dlms-cosem-rp2040/components/dlms_cosem/dlms_cosem.cpp
        if ((object_class == DLMS_OBJECT_TYPE_DATA) || (object_class == DLMS_OBJECT_TYPE_REGISTER) ||
            (object_class == DLMS_OBJECT_TYPE_EXTENDED_REGISTER)) {
          auto data_as_string =
              dlms_data_as_string(vt, raw_ptr, raw_len > UINT8_MAX ? UINT8_MAX : static_cast<uint8_t>(raw_len));
          static_cast<DlmsCosemTextSensor *>(sensor)->set_value(data_as_string.c_str(),
                                                                this->cp1251_conversion_required_);
        } else {
          ESP_LOGW(TAG, "Wrong OBIS class. We can only handle Data (class 1), Registers (class = 3), Extended "
                        "Registers (class = 4), and Clock (class = 8) for text sensors.");
        }
      }
    }
#endif
  } else {
    ESP_LOGD(TAG, "OBIS code: %s, result != DLMS_ERROR_CODE_OK = %d", obis, this->dlms_reading_state_.last_error);
  }
  return this->dlms_reading_state_.last_error;
}

void DlmsCosemComponent::indicate_transmission(bool transmission_on) {
#ifdef USE_BINARY_SENSOR
  if (this->transmission_binary_sensor_) {
    this->transmission_binary_sensor_->publish_state(transmission_on);
  }
#endif
}

void DlmsCosemComponent::indicate_session(bool session_on) {
#ifdef USE_BINARY_SENSOR
  if (this->session_binary_sensor_) {
    this->session_binary_sensor_->publish_state(session_on);
  }
#endif
}

void DlmsCosemComponent::indicate_connection(bool connection_on) {
#ifdef USE_BINARY_SENSOR
  if (this->connection_binary_sensor_) {
    this->connection_binary_sensor_->publish_state(connection_on);
  }
#endif
}

void DlmsCosemComponent::send_dlms_messages_() {
  const int MAX_BYTES_IN_ONE_SHOT = 64;
  gxByteBuffer *buffer = buffers_.out_msg.data[buffers_.out_msg_index];

  int bytes_to_send = buffer->size - buffers_.out_msg_data_pos;
  if (bytes_to_send > 0) {
    if (bytes_to_send > MAX_BYTES_IN_ONE_SHOT)
      bytes_to_send = MAX_BYTES_IN_ONE_SHOT;

    if (this->flow_control_pin_ != nullptr)
      this->flow_control_pin_->digital_write(true);

    this->write_array(buffer->data + buffers_.out_msg_data_pos, bytes_to_send);

    if (this->flow_control_pin_ != nullptr)
      this->flow_control_pin_->digital_write(false);

    ESP_LOGVV(TAG, "TX: %s", format_hex_pretty(buffer->data + buffers_.out_msg_data_pos, bytes_to_send).c_str());

    this->update_last_rx_time_();
    buffers_.out_msg_data_pos += bytes_to_send;
  }
  if (buffers_.out_msg_data_pos >= buffer->size) {
    buffers_.out_msg_index++;
  }
}

size_t DlmsCosemComponent::receive_frame_(FrameStopFunction stop_fn) {
  const uint32_t read_time_limit_ms = 45;
  size_t ret_val;

  auto count_available = this->available();
  if (count_available <= 0)
    return 0;

  uint32_t read_start = millis();
  uint8_t *p;

  // ESP_LOGVV(TAG, "avail RX: %d", count_available);
  buffers_.check_and_grow_input(count_available);

  while (count_available-- > 0) {
    if (millis() - read_start > read_time_limit_ms) {
      return 0;
    }

    p = &this->buffers_.in.data[this->buffers_.in.size];
    if (!iuart_->read_one_byte(p)) {
      return 0;
    }
    this->buffers_.in.size++;
    // this->buffers_.amount_in++;

    if (stop_fn(this->buffers_.in.data, this->buffers_.in.size)) {
      //      ESP_LOGVV(TAG, "RX: %s",
      //      format_frame_pretty(this->buffers_.in.data,
      //      this->buffers_.in.size).c_str());
      ESP_LOGVV(TAG, "RX: %s", format_hex_pretty(this->buffers_.in.data, this->buffers_.in.size).c_str());
      ret_val = this->buffers_.in.size;

      // this->buffers_.amount_in = 0;
      this->update_last_rx_time_();
      return ret_val;
    }

    yield();
    App.feed_wdt();
  }
  return 0;
}

size_t DlmsCosemComponent::receive_frame_hdlc_() {
  // HDLC frame: <FLAG>data<FLAG>
  auto frame_end_check_hdlc = [](uint8_t *b, size_t s) {
    auto ret = s >= 2 && b[0] == HDLC_FLAG && b[s - 1] == HDLC_FLAG;
    return ret;
  };
  return receive_frame_(frame_end_check_hdlc);
}

#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
size_t DlmsCosemComponent::receive_frame_raw_() {
  auto frame_end_check_timeout = [](uint8_t *b, size_t s) {
    return false;  // never stop by content, only by timeout
  };
  return receive_frame_(frame_end_check_timeout);
}
#endif

#ifdef IEC_HANDSHAKE
size_t DlmsCosemComponent::receive_frame_ascii_() {
  // "data<CR><LF>"
  ESP_LOGVV(TAG, "Waiting for ASCII frame");
  auto frame_end_check_crlf = [](uint8_t *b, size_t s) {
    auto ret = s >= 2 && b[s - 1] == '\n' && b[s - 2] == '\r';
    if (ret) {
      ESP_LOGVV(TAG, "Frame CRLF Stop");
    }
    return ret;
  };
  return receive_frame_(frame_end_check_crlf);
}
#endif

void DlmsCosemComponent::clear_rx_buffers_() {
  int available = this->available();
  if (available > 0) {
    ESP_LOGVV(TAG, "Cleaning garbage from UART input buffer: %d bytes", available);
  }

  int len;
  while (available > 0) {
    len = std::min(available, (int) buffers_.in.capacity);
    this->read_array(this->buffers_.in.data, len);
    available -= len;
  }
  memset(this->buffers_.in.data, 0, buffers_.in.capacity);
  this->buffers_.in.size = 0;
  this->buffers_.in.position = 0;
}

const LogString *DlmsCosemComponent::state_to_string(State state) {
  switch (state) {
    case State::NOT_INITIALIZED:
      return LOG_STR("NOT_INITIALIZED");
    case State::IDLE:
      return LOG_STR("IDLE");
    case State::TRY_LOCK_BUS:
      return LOG_STR("TRY_LOCK_BUS");
    case State::WAIT:
      return LOG_STR("WAIT");
    case State::COMMS_TX:
      return LOG_STR("COMMS_TX");
    case State::COMMS_RX:
      return LOG_STR("COMMS_RX");
    case State::MISSION_FAILED:
      return LOG_STR("MISSION_FAILED");
    case State::OPEN_SESSION:
      return LOG_STR("OPEN_SESSION");
    case State::BUFFERS_REQ:
      return LOG_STR("BUFFERS_REQ");
    case State::BUFFERS_RCV:
      return LOG_STR("BUFFERS_RCV");
    case State::ASSOCIATION_REQ:
      return LOG_STR("ASSOCIATION_REQ");
    case State::ASSOCIATION_RCV:
      return LOG_STR("ASSOCIATION_RCV");
    case State::DATA_ENQ_UNIT:
      return LOG_STR("DATA_ENQ_UNIT");
    case State::DATA_ENQ:
      return LOG_STR("DATA_ENQ");
    case State::DATA_RECV:
      return LOG_STR("DATA_RECV");
    case State::DATA_NEXT:
      return LOG_STR("DATA_NEXT");
    case State::SESSION_RELEASE:
      return LOG_STR("SESSION_RELEASE");
    case State::DISCONNECT_REQ:
      return LOG_STR("DISCONNECT_REQ");
    case State::PUBLISH:
      return LOG_STR("PUBLISH");
#ifdef ENABLE_DLMS_COSEM_PUSH_MODE
    case State::PUSH_DATA_PROCESS:
      return LOG_STR("PUSH_DATA_PROCESS");
#endif
    default:
      return LOG_STR("UNKNOWN");
  }
}

void DlmsCosemComponent::log_state_(State *next_state) {
  if (this->state_ != this->last_reported_state_) {
    if (next_state == nullptr) {
      ESP_LOGV(TAG, "State::%s", LOG_STR_ARG(state_to_string(this->state_)));
    } else {
      ESP_LOGV(TAG, "State::%s -> %s", LOG_STR_ARG(state_to_string(this->state_)),
               LOG_STR_ARG(state_to_string(*next_state)));
    }
    this->last_reported_state_ = this->state_;
  }
}

void DlmsCosemComponent::stats_dump() {
  ESP_LOGV(TAG, "============================================");
  ESP_LOGV(TAG, "Data collection and publishing finished.");
  ESP_LOGV(TAG, "Total number of sessions ............. %u", this->stats_.connections_tried_);
  ESP_LOGV(TAG, "Total number of invalid frames ....... %u", this->stats_.invalid_frames_);
  ESP_LOGV(TAG, "Total number of CRC errors ........... %u", this->stats_.crc_errors_);
  ESP_LOGV(TAG, "Total number of CRC errors recovered . %u", this->stats_.crc_errors_recovered_);
  ESP_LOGV(TAG, "CRC errors per session ............... %f", this->stats_.crc_errors_per_session());
  ESP_LOGV(TAG, "Number of failures ................... %u", this->stats_.failures_);
  ESP_LOGV(TAG, "============================================");
}

bool DlmsCosemComponent::try_lock_uart_session_() {
  if (AnyObjectLocker::try_lock(this->parent_)) {
    ESP_LOGV(TAG, "UART bus %p locked by %s", this->parent_, this->tag_.c_str());
    return true;
  }
  ESP_LOGV(TAG, "UART bus %p busy", this->parent_);
  return false;
}

void DlmsCosemComponent::unlock_uart_session_() {
  AnyObjectLocker::unlock(this->parent_);
  ESP_LOGV(TAG, "UART bus %p released by %s", this->parent_, this->tag_.c_str());
}

uint8_t DlmsCosemComponent::next_obj_id_ = 0;

std::string DlmsCosemComponent::generateTag() { return str_sprintf("%s%03d", TAG0, ++next_obj_id_); }

}  // namespace dlms_cosem
}  // namespace esphome
